app/controllers/books_controller.rb

INSERT INTO "books" ("body", "created_at", "updated_at", "title") VALUES (?, ?, ?, ?)  [["body", "body_b"], ["created_at", "2020-04-18 07:13:28.710994"], ["updated_at", "2020-04-18 07:13:28.710994"], ["title", "title_a"]]
SELECT "books".* FROM "books"
---
  def create
    @book = Book.new(book_params)
    if @book.save
      redirect_to book_path(@book.id), notice: 'Book was successfully created.'
    else
      @books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "update_title_a"], ["body", "update_body_b"], ["updated_at", "2020-04-18 07:13:28.812739"], ["id", 1]]
---
  def update
    book = Book.find(params[:id])
    if @book.update(book_params)